/*
 Navicat Premium Data Transfer

 Source Server         : 本地连接
 Source Server Type    : MySQL
 Source Server Version : 50725
 Source Host           : localhost
 Source Database       : hsmt

 Target Server Type    : MySQL
 Target Server Version : 50725
 File Encoding         : utf-8

 Date: 06/15/2019 20:32:44 PM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `employee`
-- ----------------------------
DROP TABLE IF EXISTS `employee`;
CREATE TABLE `employee` (
  `emp_id` varchar(10) NOT NULL,
  `emp_name` varchar(20) DEFAULT NULL,
  `emp_age` int(10) DEFAULT NULL,
  `emp_sex` varchar(10) DEFAULT NULL,
  `emp_hiredate` varchar(10) DEFAULT NULL,
  `emp_area` varchar(20) DEFAULT NULL,
  `emp_level` varchar(20) DEFAULT NULL,
  `emp_salary` int(10) DEFAULT NULL,
  `emp_group` varchar(10) DEFAULT NULL,
  PRIMARY KEY (`emp_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `employee`
-- ----------------------------
BEGIN;
INSERT INTO `employee` VALUES ('12321', '巩小辉', '11', '男', '2016-04-06', '中专', '高级工程师', '985', '配置管理组'), ('123987', '王甜甜', '78', '女', '1899-11-30', '研究生', '部门经理', '10780', '项目组'), ('1321', '阿力', '30', '男', '2016-04-06', '中专', '中级工程师', '3000', '质量体系组'), ('1328', '发斯蒂芬', '33', '女', '2016-04-05', '中专', '中级工程师', '8989', '质量体系组'), ('150166', '周小全', '36', '男', '2016-04-11', '大专', '部门组长', '7000', '配置管理组'), ('189', '大个', '23', '男', '2016-03-24', '大专', '中级工程师', '231', '商务组'), ('227979', '王夏利', '96', '男', '2016-04-11', '大专', '部门组长', '9999', '配置管理组'), ('3', '小同', '58', '男', '1899-11-30', '大专', '初级工程师', '1321', '人事行政组'), ('351610', '王璐璐', '23', '男', '2016-04-12', '本科', '部门组长', '5632', '销售组'), ('5647', '123456', '78', '女', '1899-11-30', '本科', '高级工程师', '1234', '配置管理组'), ('5689', '巩旭辉', '89', '女', '2016-04-06', '本科', '高级工程师', '985', '配置管理组'), ('6', '小白', '45', '男', '2016-03-24', '本科', '初级工程师', '1321', '人事行政组'), ('664', '供需胡', '23', '女', '2016-03-30', '本科', '高级工程师', '9630', '合同管理组'), ('675756', '巩亚伟', '11', '男', '2016-04-11', '本科', '中级工程师', '1321', '销售组'), ('7', '事的', '14', '男', '2016-03-22', '本科', '初级工程师', '1321', '人事行政组'), ('714106', '巩旭辉', '131', '男', '2016-04-11', '本科', '中级工程师', '11', '销售组'), ('760781', '巩旭辉', '23', '男', '2016-04-13', '本科', '部门组长', '5560', '测试组'), ('763903', '巩旭辉', '79', '女', '2016-04-11', '本科', '部门组长', '13213', '测试组'), ('791198', '共', '65', '女', '2016-04-11', '本科', '部门组长', '36541', '技术支持组'), ('8', '王大力', '80', '女', '2016-03-24', '本科', '部门经理', '7777', '技术支持组'), ('816111', '张蒙台', '23', '女', '2016-04-12', '本科', '部门组长', '1236', '技术支持组'), ('851852', '乔尖峰', '24', '男', '2016-04-12', '本科', '新员工', '3654', '技术支持组'), ('890', '巩旭辉', '44', '男', '2016-03-24', '研究生', '中级工程师', '7777', '合同管理组'), ('897', '刘丹莉', '11', '男', '1899-11-30', '研究生', '中级工程师', '5000', '合同管理组'), ('961073', '共里', '12', '女', '2016-03-29', '研究生', '新员工', '1111', '共享开发组'), ('BBH269293', '白百何', '36', '女', '2016-05-24', '技校', '中级工程师', '2345', '质量体系组'), ('BDD483916', '班冬冬', '24', '男', '2016-05-22', '研究生', '实习生', '4563', '技术支持组'), ('GLL90431', '巩里龙', '25', '男', '2016-05-24', '技校', '初级工程师', '1231', '销售组'), ('GXH436307', '巩小辉', '23', '男', '2016-05-24', '本科', '高级工程师', '6000', '合同管理组'), ('GXH6824', '巩旭辉', '123', '男', '2016-02-09', '本科', '高级工程师', '7899', '共享开发组'), ('LDL894281', '刘丹莉', '24', '女', '2016-05-09', '研究生', '高级工程师', '10000', '共享开发组'), ('LF687586', '李飞', '23', '男', '2016-05-24', '博士', '高级工程师', '10000', '项目组'), ('LHL974674', '李海林', '27', '男', '2016-05-01', '大专', '初级工程师', '2323', '技术支持组'), ('LLY26755', '李连义', '23', '男', '2016-05-04', '中专', '高级工程师', '3654', '技术支持组'), ('LNN111834', '李娜娜', '24', '女', '2016-05-24', '中专', '中级工程师', '6000', '项目组'), ('LXY616022', '李逍遥', '34', '男', '2016-05-24', '研究生', '高级工程师', '8000', '项目组'), ('LYY78762', '刘英勇', '23', '男', '2016-05-24', '研究生', '初级工程师', '5000', '项目组'), ('SQ965725', '商祺', '23', '男', '2016-05-03', '本科', '初级工程师', '5230', '配置管理组'), ('TT644961', '天天', '23', '女', '2016-05-25', '高中', '实习生', '3000', '共享开发组'), ('WDL571488', '王大力', '34', '男', '2016-04-19', '大专', '高级工程师', '9875', '人事行政组'), ('WLL643390', '王路路', '23', '男', '2016-05-01', '本科', '中级工程师', '6354', '测试组'), ('YH241462', '杨华', '30', '男', '2016-05-24', '本科', '中级工程师', '6000', '商务组'), ('ZLE643710', '赵灵儿', '23', '女', '2016-05-23', '本科', '中级工程师', '8000', '项目组'), ('ZXQ82069', '周小全', '30', '男', '2016-05-24', '大专', '中级工程师', '5000', '共享开发组');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
